Show / Hide Table of Contents
Class ResultOnMember
Result of the member
Inheritance
System.Object
ResultOnMember
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
public class ResultOnMember
Constructors
Improve this Doc   View Source
ResultOnMember()
Constructor
Declaration
public ResultOnMember()
Improve this Doc   View Source
ResultOnMember(Member, ResultType)
Constructor
Declaration
public ResultOnMember(Member member, ResultType resultType)
Parameters
 Type |  Name |  Description
 Member |  member
Member
 ResultType |  resultType
Type of result
Properties
Improve this Doc   View Source
LocalSystemType
Type of local system of result
Declaration
public ResultLocalSystemType LocalSystemType { get; set; }
Property Value
 Type |  Description
 ResultLocalSystemType
Improve this Doc   View Source
Member
Member
Declaration
public Member Member { get; set; }
Property Value
 Type |  Description
 Member
Improve this Doc   View Source
Results
List of result
Declaration
public List<ResultBase> Results { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ResultBase>
Improve this Doc   View Source
ResultType
Type of result
Declaration
public ResultType ResultType { get; set; }
Property Value
 Type |  Description
 ResultType
 Improve this Doc
 View Source